# CannotPlaceRebar Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..CannotPlaceRebar Property
BuiltInFailures..::..RebarFailures Class See Also
---
Can't find a host for Rebar.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlaceRebar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlaceRebar As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlaceRebar {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace